TexasInstruments/c2000ware-core-sdk/driverlib/f2807x/examples/cpu1/usb/usb_ex8_dual_detect.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "F2837xD" --package "F2837xD_100PTP" --part "F2837xD_100PTP" --product "C2000WARE@4.02.00.00"
 * @versions {"tool":"1.13.0+2411"}
 */

/**
 * Import the modules used in this configuration.
 */
const usb  = scripting.addModule("/driverlib/usb.js", {}, false);
const usb1 = usb.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
usb1.$name                   = "myUSB0";
usb1.registerInterrupts      = true;
usb1.usb.$assign             = "USB0";
usb1.usb.usbdmPin.$assign    = "ball.73";
usb1.usb.usbdpPin.$assign    = "ball.74";
usb1.usbLib.usb_mode         = "Dual";
usb1.usbLib.deviceClasses    = "Mouse";
usb1.dmQual.$name            = "myGPIOQUAL0";
usb1.dpQual.$name            = "myGPIOQUAL1";
usb1.USBInt.enableInterrupt  = true;
usb1.USBInt.interruptHandler = "f28x_USB0DualModeIntHandler";
